; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-2 - location
	p0-3 - location
	p1-2 - location
	p1-4 - location
	p2-4 - location
	p4-6 - location
	p4-7 - location
	p5-1 - location
	p5-4 - location
	p6-3 - location
	p6-7 - location
	p7-0 - location
	p7-3 - location
	p7-5 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s5)
	(at driver3 s1)
	(at driver4 s6)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at package1 s2)
	(at package2 s7)
	(at package3 s4)
	(at package4 s1)
	(at package5 s3)
	(at package6 s6)
	(at package7 s7)
	(at package8 s7)
	(at package9 s5)
	(at package10 s4)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 97)
	(= (time-to-walk p0-2 s0) 97)
	(= (time-to-walk s2 p0-2) 8)
	(= (time-to-walk p0-2 s2) 8)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 37)
	(= (time-to-walk p0-3 s0) 37)
	(= (time-to-walk s3 p0-3) 84)
	(= (time-to-walk p0-3 s3) 84)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 5)
	(= (time-to-walk p1-2 s1) 5)
	(= (time-to-walk s2 p1-2) 53)
	(= (time-to-walk p1-2 s2) 53)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 80)
	(= (time-to-walk p1-4 s1) 80)
	(= (time-to-walk s4 p1-4) 60)
	(= (time-to-walk p1-4 s4) 60)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 84)
	(= (time-to-walk p2-4 s2) 84)
	(= (time-to-walk s4 p2-4) 46)
	(= (time-to-walk p2-4 s4) 46)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 83)
	(= (time-to-walk p4-6 s4) 83)
	(= (time-to-walk s6 p4-6) 7)
	(= (time-to-walk p4-6 s6) 7)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 2)
	(= (time-to-walk p4-7 s4) 2)
	(= (time-to-walk s7 p4-7) 24)
	(= (time-to-walk p4-7 s7) 24)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 96)
	(= (time-to-walk p5-1 s5) 96)
	(= (time-to-walk s1 p5-1) 32)
	(= (time-to-walk p5-1 s1) 32)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 11)
	(= (time-to-walk p5-4 s5) 11)
	(= (time-to-walk s4 p5-4) 7)
	(= (time-to-walk p5-4 s4) 7)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 52)
	(= (time-to-walk p6-3 s6) 52)
	(= (time-to-walk s3 p6-3) 99)
	(= (time-to-walk p6-3 s3) 99)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(= (time-to-walk s6 p6-7) 100)
	(= (time-to-walk p6-7 s6) 100)
	(= (time-to-walk s7 p6-7) 43)
	(= (time-to-walk p6-7 s7) 43)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 88)
	(= (time-to-walk p7-0 s7) 88)
	(= (time-to-walk s0 p7-0) 39)
	(= (time-to-walk p7-0 s0) 39)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(= (time-to-walk s7 p7-3) 22)
	(= (time-to-walk p7-3 s7) 22)
	(= (time-to-walk s3 p7-3) 59)
	(= (time-to-walk p7-3 s3) 59)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 77)
	(= (time-to-walk p7-5 s7) 77)
	(= (time-to-walk s5 p7-5) 91)
	(= (time-to-walk p7-5 s5) 91)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 19)
	(= (time-to-drive s5 s0) 19)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 56)
	(= (time-to-drive s6 s0) 56)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 27)
	(= (time-to-drive s7 s0) 27)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 15)
	(= (time-to-drive s0 s1) 15)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 63)
	(= (time-to-drive s6 s1) 63)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 64)
	(= (time-to-drive s0 s2) 64)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 98)
	(= (time-to-drive s7 s2) 98)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 68)
	(= (time-to-drive s7 s3) 68)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 16)
	(= (time-to-drive s0 s4) 16)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 78)
	(= (time-to-drive s1 s4) 78)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 27)
	(= (time-to-drive s5 s4) 27)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 100)
	(= (time-to-drive s6 s4) 100)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 24)
	(= (time-to-drive s2 s5) 24)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 9)
	(= (time-to-drive s3 s5) 9)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 7)
	(= (time-to-drive s2 s6) 7)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 26)
	(= (time-to-drive s5 s6) 26)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 33)
	(= (time-to-drive s4 s7) 33)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s5)
	(at truck1 s7)
	(at truck2 s7)
	(at truck3 s5)
	(at package1 s0)
	(at package2 s1)
	(at package3 s2)
	(at package4 s1)
	(at package5 s7)
	(at package6 s0)
	(at package7 s7)
	(at package8 s3)
	(at package9 s3)
	(at package10 s6)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver1 truck2 s7)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 14
2. (load-truck package2 truck2 s7)
   deleted: (at package2 s7)
   added: (in package2 truck2)
   goals met: 4 of 14
3. (load-truck package8 truck2 s7)
   deleted: (at package8 s7)
   added: (in package8 truck2)
   goals met: 4 of 14
4. (walk driver4 s6 p6-3)
   deleted: (at driver4 s6)
   added: (at driver4 p6-3)
   changed: (walked) from 0 to 52
   goals met: 4 of 14
5. (walk driver4 p6-3 s3)
   deleted: (at driver4 p6-3)
   added: (at driver4 s3)
   changed: (walked) from 52 to 151
   goals met: 4 of 14
6. (drive-truck truck2 s7 s4 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   changed: (driven) from 0 to 33
   goals met: 3 of 14
7. (load-truck package10 truck2 s4)
   deleted: (at package10 s4)
   added: (in package10 truck2)
   goals met: 3 of 14
8. (load-truck package3 truck2 s4)
   deleted: (at package3 s4)
   added: (in package3 truck2)
   goals met: 3 of 14
9. (drive-truck truck2 s4 s0 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (driven) from 33 to 49
   goals met: 3 of 14
10. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 14
11. (load-truck package5 truck1 s3)
   deleted: (at package5 s3)
   added: (in package5 truck1)
   goals met: 3 of 14
12. (drive-truck truck1 s3 s7 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   changed: (driven) from 49 to 117
   goals met: 4 of 14
13. (unload-truck package5 truck1 s7)
   deleted: (in package5 truck1)
   added: (at package5 s7)
   goals met: 5 of 14
14. (drive-truck truck2 s0 s2 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 117 to 181
   goals met: 5 of 14
15. (unload-truck package3 truck2 s2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   goals met: 6 of 14
16. (load-truck package1 truck2 s2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 6 of 14
17. (drive-truck truck2 s2 s5 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (driven) from 181 to 205
   goals met: 6 of 14
18. (load-truck package9 truck2 s5)
   deleted: (at package9 s5)
   added: (in package9 truck2)
   goals met: 6 of 14
19. (drive-truck truck2 s5 s0 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (driven) from 205 to 224
   goals met: 6 of 14
20. (drive-truck truck1 s7 s3 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s3)
   changed: (driven) from 224 to 292
   goals met: 5 of 14
21. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   goals met: 6 of 14
22. (disembark-truck driver4 truck1 s3)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 6 of 14
23. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 292 to 307
   goals met: 6 of 14
24. (unload-truck package2 truck2 s1)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   goals met: 7 of 14
25. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 307 to 322
   goals met: 7 of 14
26. (drive-truck truck2 s0 s7 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   changed: (driven) from 322 to 349
   goals met: 8 of 14
27. (drive-truck truck2 s7 s3 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s3)
   changed: (driven) from 349 to 417
   goals met: 7 of 14
28. (unload-truck package8 truck2 s3)
   deleted: (in package8 truck2)
   added: (at package8 s3)
   goals met: 8 of 14
29. (unload-truck package9 truck2 s3)
   deleted: (in package9 truck2)
   added: (at package9 s3)
   goals met: 9 of 14
30. (drive-truck truck2 s3 s7 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s7)
   changed: (driven) from 417 to 485
   goals met: 10 of 14
31. (drive-truck truck2 s7 s0 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s0)
   changed: (driven) from 485 to 512
   goals met: 9 of 14
32. (board-truck driver4 truck3 s3)
   deleted: (at driver4 s3) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 9 of 14
33. (drive-truck truck2 s0 s6 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (driven) from 512 to 568
   goals met: 9 of 14
34. (load-truck package6 truck2 s6)
   deleted: (at package6 s6)
   added: (in package6 truck2)
   goals met: 9 of 14
35. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (driven) from 568 to 624
   goals met: 9 of 14
36. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   goals met: 10 of 14
37. (drive-truck truck2 s0 s7 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   changed: (driven) from 624 to 651
   goals met: 11 of 14
38. (drive-truck truck3 s3 s7 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s7)
   changed: (driven) from 651 to 719
   goals met: 11 of 14
39. (drive-truck truck3 s7 s4 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   changed: (driven) from 719 to 752
   goals met: 11 of 14
40. (drive-truck truck2 s7 s3 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s3)
   changed: (driven) from 752 to 820
   goals met: 10 of 14
41. (drive-truck truck3 s4 s5 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (driven) from 820 to 847
   goals met: 11 of 14
42. (unload-truck package10 truck2 s3)
   deleted: (in package10 truck2)
   added: (at package10 s3)
   goals met: 11 of 14
43. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 11 of 14
44. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 11 of 14
45. (drive-truck truck1 s3 s7 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   changed: (driven) from 847 to 915
   goals met: 12 of 14
46. (drive-truck truck3 s5 s3 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (driven) from 915 to 924
   goals met: 11 of 14
47. (drive-truck truck1 s7 s4 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   changed: (driven) from 924 to 957
   goals met: 10 of 14
48. (load-truck package10 truck3 s3)
   deleted: (at package10 s3)
   added: (in package10 truck3)
   goals met: 10 of 14
49. (drive-truck truck3 s3 s5 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 957 to 966
   goals met: 11 of 14
50. (drive-truck truck3 s5 s6 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (driven) from 966 to 992
   goals met: 10 of 14
51. (unload-truck package10 truck3 s6)
   deleted: (in package10 truck3)
   added: (at package10 s6)
   goals met: 11 of 14
52. (disembark-truck driver4 truck3 s6)
   deleted: (driving driver4 truck3)
   added: (at driver4 s6) (empty truck3)
   goals met: 11 of 14
53. (drive-truck truck1 s4 s7 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   changed: (driven) from 992 to 1025
   goals met: 12 of 14
54. (walk driver4 s6 p6-3)
   deleted: (at driver4 s6)
   added: (at driver4 p6-3)
   changed: (walked) from 151 to 203
   goals met: 12 of 14
55. (walk driver4 p6-3 s3)
   deleted: (at driver4 p6-3)
   added: (at driver4 s3)
   changed: (walked) from 203 to 302
   goals met: 12 of 14
56. (board-truck driver4 truck2 s3)
   deleted: (at driver4 s3) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 12 of 14
57. (drive-truck truck2 s3 s7 driver4)
   deleted: (at truck2 s3)
   added: (at truck2 s7)
   changed: (driven) from 1025 to 1093
   goals met: 13 of 14
58. (disembark-truck driver4 truck2 s7)
   deleted: (driving driver4 truck2)
   added: (at driver4 s7) (empty truck2)
   goals met: 13 of 14
59. (walk driver4 s7 p6-7)
   deleted: (at driver4 s7)
   added: (at driver4 p6-7)
   changed: (walked) from 302 to 345
   goals met: 13 of 14
60. (walk driver4 p6-7 s6)
   deleted: (at driver4 p6-7)
   added: (at driver4 s6)
   changed: (walked) from 345 to 445
   goals met: 13 of 14
61. (board-truck driver4 truck3 s6)
   deleted: (at driver4 s6) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 13 of 14
62. (drive-truck truck3 s6 s5 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (driven) from 1093 to 1119
   goals met: 14 of 14
